In [49]:
import numpy as np
import pandas as pd

In [50]:
my_lst = [1,2,3,4,5]
my_str = ['a','b','c','d','e']
my_arr = np.array([10,20,30,40,50])
d = {'A': 100, 'B':200,'C':300}

In [115]:
name1 = ['hassnat', 'uzma', 'haroon']
num_physics = [90, 92, 83]
name2 = ['hassnat', 'uzma', 'hanaf']
num_maths = [90, 92, 83]

series = pd.Series(num_physics,name1)
series2 = pd.Series(num_maths,name2)

series['hassnat']

90

In [116]:
ser = series + series2
ser

hanaf        NaN
haroon       NaN
hassnat    180.0
uzma       184.0
dtype: float64

In [51]:
pd.Series(my_str,my_lst)

1    a
2    b
3    c
4    d
5    e
dtype: object

In [52]:
pd.Series(my_arr)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [53]:
pd.Series(d)

A    100
B    200
C    300
dtype: int64

In [54]:
ser1 = pd.Series(my_str,my_lst)
ser1[5]

'e'

In [55]:
ser2 =pd.Series([5,10,15,20], ['uzz','hass','naz', 'cookie'])

In [56]:
ser2['cookie']

20

In [57]:
ser3 =pd.Series([5,10,15,20], ['uzz','hass','rani', 'bambi'])

In [58]:
ser3

uzz       5
hass     10
rani     15
bambi    20
dtype: int64

In [59]:
ser2 + ser3

bambi      NaN
cookie     NaN
hass      20.0
naz        NaN
rani       NaN
uzz       10.0
dtype: float64

In [44]:
# data frames

In [120]:
from numpy.random import randn
np.random.seed(101)

In [123]:
df = pd.DataFrame(randn(4,4),index= 'u z m a'.split(), columns= 'n a z o'.split())
df

          n         a         z         o
u -0.116773  1.901755  0.238127  1.996652
z -0.993263  0.196800 -1.136645  0.000366
m  1.025984 -0.156598 -0.031579  0.649826
a  2.154846 -0.610259 -0.755325 -0.346419

In [128]:
df.loc['m']

n    1.025984
a   -0.156598
z   -0.031579
o    0.649826
Name: m, dtype: float64

In [145]:
df['hassnat'] =  df[]
df

          n         a         z         o  hassnat
u -0.116773  1.901755  0.238127  1.996652        0
z -0.993263  0.196800 -1.136645  0.000366        1
m  1.025984 -0.156598 -0.031579  0.649826        2
a  2.154846 -0.610259 -0.755325 -0.346419        3

In [147]:
 np.arange(6,10).reshape(4,1)

array([[6],
       [7],
       [8],
       [9]])

In [92]:
df.shape

(4, 5)

In [96]:
df.drop('new', axis=1)

          n         a         z         o
u -0.162535  0.485809  0.392489  0.221491
z -0.855196  1.541990  0.666319 -0.538235
m -0.568581  1.407338  0.641806 -0.905100
a -0.391157  1.028293 -1.972605 -0.866885

In [100]:
df.loc['m']

n     -0.568581
a      1.407338
z      0.641806
o     -0.905100
new   -0.568581
Name: m, dtype: float64

In [102]:
df.iloc[1]

n     -0.855196
a      1.541990
z      0.666319
o     -0.538235
new   -0.855196
Name: z, dtype: float64

In [104]:
df.loc['u','z']

0.39248881107944394

In [105]:
df.loc[['u','z'],['a','o']]

          a         o
u  0.485809  0.221491
z  1.541990 -0.538235

In [106]:
df

          n         a         z         o       new
u -0.162535  0.485809  0.392489  0.221491 -0.162535
z -0.855196  1.541990  0.666319 -0.538235 -0.855196
m -0.568581  1.407338  0.641806 -0.905100 -0.568581
a -0.391157  1.028293 -1.972605 -0.866885 -0.391157

In [148]:
df<0

       n      a      z      o  hassnat
u   True  False  False  False    False
z   True  False   True  False    False
m  False   True   True  False    False
a  False   True   True   True    False

In [108]:
df[df>0]

    n         a         z         o  new
u NaN  0.485809  0.392489  0.221491  NaN
z NaN  1.541990  0.666319       NaN  NaN
m NaN  1.407338  0.641806       NaN  NaN
a NaN  1.028293       NaN       NaN  NaN

In [149]:
df[df['o']>0]

          n         a         z         o  hassnat
u -0.116773  1.901755  0.238127  1.996652        0
z -0.993263  0.196800 -1.136645  0.000366        1
m  1.025984 -0.156598 -0.031579  0.649826        2

In [150]:
df

          n         a         z         o  hassnat
u -0.116773  1.901755  0.238127  1.996652        0
z -0.993263  0.196800 -1.136645  0.000366        1
m  1.025984 -0.156598 -0.031579  0.649826        2
a  2.154846 -0.610259 -0.755325 -0.346419        3

In [155]:
df.drop('hassnat', axis=1, inplace= True)

In [156]:
df

          n         a         z         o
u -0.116773  1.901755  0.238127  1.996652
z -0.993263  0.196800 -1.136645  0.000366
m  1.025984 -0.156598 -0.031579  0.649826
a  2.154846 -0.610259 -0.755325 -0.346419